Revit 2027 API
TemporaryGraphicsManager.RemoveControl Method
 Deletes the existing control identified by the unique index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveControl(
	int index
)
Public Sub RemoveControl (
	index As Integer
)
public:
void RemoveControl(
	int index
)
member RemoveControl :
        index : int -> unit
Parameters
index Int32
 Unique index of the control to be deleted.
Exceptions
Exception | Condition
ArgumentException |  index is out of range of TemporaryGraphicsManager managed objects, or the indexed object has been removed from the document.
See Also
Reference
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace